// 1. Дан непустой массив чисел. Написать алгоритм (не исползьуя встроенные методы), который изменит
// исходный массив так, чтобы числа в нём шли в обратном порядке

// const arr = [1, 2, 3, 4, 5];
// const arr2 = [];

// for (let i = 0, j = arr.length - 1; i < arr.length; j--,i++ ) {
//   arr2[j] = arr[i];
// }
// for (let i = 0; i < arr.length; i++) {
//   arr[i] = arr2[i];
// }
// console.log(arr);

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// 2. Дан массив и переменная с неким значением. Реализовать алгоритм встроенного метода unshift, не используя встроенные методы

// const arr = [1,2,3];
// const elemnet = 'began';
// const arr2 = [];

// for(let i = arr.length; i>0; i--){
//     arr2[i] =arr[i-1] ;
// }
// arr2[0] = elemnet;
// console.log(arr2);

///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 3. Дан некий объект и 10 попыток для ползователя, чтобы ввести названия полей этого объекта.
// Написать алгоритм, который по окончании выведет в консоль 2 массива:
// 	+ Поля, которые были в объекте
// 	+ Поля, которые не были в объекте

const obj = {
  name: 'Leyla',
  age: 17,
};

const arrIn = [];
const arrOn = [];

for (let i = 0; i <= 10; i++) {
  let input = prompt("Vvedite: ");
  if (Object.hasOwn(obj, input)) {
    arrIn.push(input);
  } else {
    arrOn.push(input);
  }
}

console.log(arrIn, arrOn);
